src/mapred.org
#+title: mapred

** Scheduler
- Fair Scheduler Guide http://archive.cloudera.com/cdh/3/hadoop/fair_scheduler.html
- Job Scheduling in Hadoop | Apache Hadoop for the Enterprise | Cloudera http://www.cloudera.com/blog/2008/11/job-scheduling-in-hadoop/
- Understanding Apache Hadoop’s Capacity Scheduler | Hortonworks http://hortonworks.com/blog/understanding-apache-hadoops-capacity-scheduler/
- Upcoming Functionality in “Fair Scheduler 2.0″ | Apache Hadoop for the Enterprise | Cloudera http://www.cloudera.com/blog/2009/04/upcoming-functionality-in-fair-scheduler-20/
- Hadoop公平调度器指南(zz) - 星星的日志 - 网易博客 : http://duanple.blog.163.com/blog/static/709717672011713111832580/
- Hadoop 中的调度 : http://www.ibm.com/developerworks/cn/opensource/os-hadoop-scheduling/

** hadoop-lzo
*** 安装配置
- 安装liblzo2库，sudo apt-get install liblzo2-2(liblzo2-dev)
- 安装lzop程序，sudo apt-get install lzop
  - for MAC. brew install lzop
- 下载hadoop-lzo. git clone git://github.com/kevinweil/hadoop-lzo.git
  - https://github.com/kevinweil/hadoop-lzo
  - https://github.com/twitter/hadoop-lzo *提供maven地址*
  - http://code.google.com/a/apache-extras.org/p/hadoop-gpl-compression/
- 编译，ant compile-native tar
- 将结果build/hadoop-lzo-0.4.14的hadoop-lzo-0.4.14.jar复制到 $HADOOP_HOME/lib，将build/hadoop-lzo-0.4.14/lib/native下的文件复制到$HADOOP_HOME/lib/native (native/Linux-amd64-64)
  - 如果没有安装hadoop只是打算本地编译然后提交任务的话，那么可以设置下面两个环境变量
  - export HADOOP_CLASSPATH=/path/to/your/hadoop-lzo-lib.jar
  - export JAVA_LIBRARY_PATH=/path/to/hadoop-lzo-native-libs:/path/to/standard-hadoop-native-libs
- 修改core-site.xml配置
#+BEGIN_SRC XML
<property>
<name>io.compression.codecs</name>
<value>org.apache.hadoop.io.compress.GzipCodec,org.apache.hadoop.io.compress.DefaultCodec,com.hadoop.compression.lzo.LzoCodec,com.hadoop.compression.lzo.LzopCodec,org.apache.hadoop.io.compress.BZip2Codec</value>
</property>
<property>
<name>io.compression.codec.lzo.class</name>
<value>com.hadoop.compression.lzo.LzoCodec</value>
</property>
#+END_SRC

*** 使用lzo
关于如何使用lzo可以参看代码示例 [[file:codes/java/mr/src/main/java/com/dirlt/java/mr/ReadLzoInput.java][code on github]]. 下面几点需要说明：
- LzoTextInputFormat用来处理lzo压缩的文本文件，
  - hadoop-lzo本身没有自带LzoTextOutputFormat，这样的话之能够输出TextOutputFormat然后通过lzop压缩
  - *elephant-bird提供了很多额外的InputFormat/OutputFormat.*
- 如果使用本地测试集群的话，那么需要提供lzo encoder/decoder.
  - Configuration conf = new Configuration(); // 如果是本地测试集群的话，那么是没有读取core-site.xml的，因此也就是没有编码解码信息，需要通过下面语句提供
  - conf.set("io.compression.codecs", "org.apache.hadoop.io.compress.DefaultCodec,org.apache.hadoop.io.compress.GzipCodec,com.hadoop.compression.lzo.LzopCodec");
  - conf.set("io.compression.codec.lzo.class", "com.hadoop.compression.lzo.LzoCodec");
- LzoIndexer.main(new String[]{kOutputFileName}); // 如果需要在程序里面进行indexer的话，那么可以直接调用LzoIndexer
  - 如果是分布式的话可以调用 DistributedLzoIndexer.main
  - 当然也可以按照下面的方法通过程序调用

之后在输出目录下面会存在很多lzo文件，但是这些文件并不能够直接作为输入使用（因为hadoop不知道如何对这些lzo文件进行切分），需要对这些lzo文件进行索引。使用下面的命令来进行索引：
- hadoop jar /usr/lib/hadoop/lib/hadoop-lzo-0.4.14.jar com.hadoop.compression.lzo.DistributedLzoIndexer <output-dir>
完成之后对于每一个lzo文件都会存在一个.index文件。如果重复运行上面命令的话，会检查.index文件是否存在，如果存在的话那么就不会重新进行索引。

如果需要单独使用lzo而不是使用mapreduce来做压缩和解压缩的话，可以参考 [[file:codes/java/mr/src/main/java/com/dirlt/java/mr/UseLzoStandadlone.java][code on github]].

*** 配合protobuf
elephant-bird实现了protobuf+lzo组合使用方式。

首先创建proto文件，比如message.proto
#+BEGIN_EXAMPLE
package com.dirlt.java.mr.proto;

// FATAL: This name works as a version number
// Increase this number everytime you do a non-compatible modification!!
// The block storage writer is responsible for write the version number.
option java_outer_classname = "MessageProtos1";

message Message {
  required string text = 1;
}
#+END_EXAMPLE
- package 名字空间
- java_outer_classname 具体输出类名称
使用protoc --java_out=<dir> message.proto就会在<dir>下面生成MessageProtos1.java文件。

此外我们还需要为这个类写几个辅助类，但是索性的是辅助类并不是很复杂。
- InputFormat [[file:codes/java/mr/src/main/java/com/dirlt/java/mr/MessageLzoProtobufInputFormat.java][code on github]]
#+BEGIN_SRC Java
public class MessageLzoProtobufInputFormat extends LzoProtobufBlockInputFormat<MessageProtos1.Message> {
    public MessageLzoProtobufInputFormat() {
        super(new TypeRef<MessageProtos1.Message>() {
        });
    }
}
#+END_SRC

- OutputFormat [[file:codes/java/mr/src/main/java/com/dirlt/java/mr/MessageLzoProtobufOutputFormat.java][code on github]]
#+BEGIN_SRC Java
public class MessageLzoProtobufOutputFormat extends LzoProtobufBlockOutputFormat<MessageProtos1.Message> {
    public MessageLzoProtobufOutputFormat() {
        super(new TypeRef<MessageProtos1.Message>() {
        });
    }
}
#+END_SRC

- Writable [[file:codes/java/mr/src/main/java/com/dirlt/java/mr/MessageLzoProtobufWritable.java][code on github]]
#+BEGIN_SRC Java
public class MessageLzoProtobufWritable extends ProtobufWritable<MessageProtos1.Message> {
    public MessageLzoProtobufWritable() {
        super(new TypeRef<MessageProtos1.Message>() {
        });
    }

    public MessageLzoProtobufWritable(MessageProtos1.Message message) {
        super(message, new TypeRef<MessageProtos1.Message>() {
        });
    }
}

#+END_SRC

关于如何使用lzo+protobuf可以参看代码示例 [[file:codes/java/mr/src/main/java/com/dirlt/java/mr/UseLzoProtobuf.java][code on github]]. 值得注意的是如果输入为lzo文件的话，那么类型是ProtobufWritable<M>（泛型），如果需要取值的话必须通过setConverter提供类信息。

** 多路输入
