html/mapred.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>mapred</title>
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="dirtysalt" />
<link rel="shortcut icon" href="/themes/favicon.ico" /><link rel="stylesheet" type="text/css" href="/themes/simple.css"/></head>
<body>
<div id="content">
<h1 class="title">mapred</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. Scheduler</a></li>
<li><a href="#sec-2">2. hadoop-lzo</a>
<ul>
<li><a href="#sec-2-1">2.1. 安装配置</a></li>
<li><a href="#sec-2-2">2.2. 使用lzo</a></li>
<li><a href="#sec-2-3">2.3. 配合protobuf</a></li>
</ul>
</li>
<li><a href="#sec-3">3. 多路输入</a>
<ul>
<li><a href="#sec-3-1">3.1. MultipleInputs</a></li>
<li><a href="#sec-3-2">3.2. MultipleTableInputFormat</a></li>
</ul>
</li>
<li><a href="#sec-4">4. 多路输出</a>
<ul>
<li><a href="#sec-4-1">4.1. MultipleOutputs</a></li>
<li><a href="#sec-4-2">4.2. MultipleTableOutputFormat</a></li>
</ul>
</li>
<li><a href="#sec-5">5. 获取集群运行状况</a></li>
<li><a href="#sec-6">6. OutOfMemoryError</a></li>
<li><a href="#sec-7">7. topology rack awareness</a></li>
<li><a href="#sec-8">8. streaming</a></li>
<li><a href="#sec-9">9. Too many fetch-failures</a></li>
<li><a href="#sec-10">10. blacklist</a></li>
<li><a href="#sec-11">11. 磁盘空间</a></li>
<li><a href="#sec-12">12. getMapOutput failed</a>
<ul>
<li><a href="#sec-12-1">12.1. normal case</a></li>
<li><a href="#sec-12-2">12.2. bas case</a></li>
</ul>
</li>
<li><a href="#sec-13">13. Error initializing</a>
<ul>
<li><a href="#sec-13-1">13.1. No such file or directory</a></li>
</ul>
</li>
<li><a href="#sec-14">14. shuffleInMemory OutOfMemoryError</a></li>
<li><a href="#sec-15">15. HowManyMapsAndReduces</a></li>
</ul>
</div>
</div>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Scheduler</h2>
<div class="outline-text-2" id="text-1">
<ul class="org-ul">
<li>Fair Scheduler Guide <a href="http://archive.cloudera.com/cdh/3/hadoop/fair_scheduler.html">http://archive.cloudera.com/cdh/3/hadoop/fair_scheduler.html</a>
</li>
<li>Job Scheduling in Hadoop | Apache Hadoop for the Enterprise | Cloudera <a href="http://www.cloudera.com/blog/2008/11/job-scheduling-in-hadoop/">http://www.cloudera.com/blog/2008/11/job-scheduling-in-hadoop/</a>
</li>
<li>Understanding Apache Hadoop’s Capacity Scheduler | Hortonworks <a href="http://hortonworks.com/blog/understanding-apache-hadoops-capacity-scheduler/">http://hortonworks.com/blog/understanding-apache-hadoops-capacity-scheduler/</a>
</li>
<li>Upcoming Functionality in “Fair Scheduler 2.0″ | Apache Hadoop for the Enterprise | Cloudera <a href="http://www.cloudera.com/blog/2009/04/upcoming-functionality-in-fair-scheduler-20/">http://www.cloudera.com/blog/2009/04/upcoming-functionality-in-fair-scheduler-20/</a>
</li>
<li>Hadoop公平调度器指南(zz) - 星星的日志 - 网易博客 : <a href="http://duanple.blog.163.com/blog/static/709717672011713111832580/">http://duanple.blog.163.com/blog/static/709717672011713111832580/</a>
</li>
<li>Hadoop 中的调度 : <a href="http://www.ibm.com/developerworks/cn/opensource/os-hadoop-scheduling/">http://www.ibm.com/developerworks/cn/opensource/os-hadoop-scheduling/</a>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> hadoop-lzo</h2>
<div class="outline-text-2" id="text-2">
</div><div id="outline-container-sec-2-1" class="outline-3">
<h3 id="sec-2-1"><span class="section-number-3">2.1</span> 安装配置</h3>
<div class="outline-text-3" id="text-2-1">
<ul class="org-ul">
<li>安装liblzo2库，sudo apt-get install liblzo2-2(liblzo2-dev)
</li>
<li>安装lzop程序，sudo apt-get install lzop
<ul class="org-ul">
<li>for MAC. brew install lzop
</li>
</ul>
</li>
<li>下载hadoop-lzo. git clone git://github.com/kevinweil/hadoop-lzo.git
<ul class="org-ul">
<li><a href="https://github.com/kevinweil/hadoop-lzo">https://github.com/kevinweil/hadoop-lzo</a>
</li>
<li><a href="https://github.com/twitter/hadoop-lzo">https://github.com/twitter/hadoop-lzo</a> <b>提供maven地址</b>
</li>
<li><a href="http://code.google.com/a/apache-extras.org/p/hadoop-gpl-compression/">http://code.google.com/a/apache-extras.org/p/hadoop-gpl-compression/</a>
</li>
</ul>
</li>
<li>编译，ant compile-native tar
</li>
<li>将结果build/hadoop-lzo-0.4.14的hadoop-lzo-0.4.14.jar复制到 $HADOOP_HOME/lib，将build/hadoop-lzo-0.4.14/lib/native下的文件复制到$HADOOP_HOME/lib/native (native/Linux-amd64-64)
<ul class="org-ul">
<li>如果没有安装hadoop只是打算本地编译然后提交任务的话，那么可以设置下面两个环境变量
</li>
<li>export HADOOP_CLASSPATH=/path/to/your/hadoop-lzo-lib.jar
</li>
<li>export JAVA_LIBRARY_PATH=/path/to/hadoop-lzo-native-libs:/path/to/standard-hadoop-native-libs
</li>
</ul>
</li>
<li>修改core-site.xml配置
</li>
</ul>
<div class="org-src-container">

<pre class="src src-XML">&lt;property&gt;
&lt;name&gt;io.compression.codecs&lt;/name&gt;
&lt;value&gt;org.apache.hadoop.io.compress.GzipCodec,org.apache.hadoop.io.compress.DefaultCodec,com.hadoop.compression.lzo.LzoCodec,com.hadoop.compression.lzo.LzopCodec,org.apache.hadoop.io.compress.BZip2Codec&lt;/value&gt;
&lt;/property&gt;
&lt;property&gt;
&lt;name&gt;io.compression.codec.lzo.class&lt;/name&gt;
&lt;value&gt;com.hadoop.compression.lzo.LzoCodec&lt;/value&gt;
&lt;/property&gt;
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-2-2" class="outline-3">
<h3 id="sec-2-2"><span class="section-number-3">2.2</span> 使用lzo</h3>
<div class="outline-text-3" id="text-2-2">
<p>
关于如何使用lzo可以参看代码示例 <a href="https://github.com/dirtysalt/codes/tree/master/java/mr/src/main/java/com/dirlt/java/mr/ReadLzoInput.java">code on github</a>. 下面几点需要说明：
</p>
<ul class="org-ul">
<li>LzoTextInputFormat用来处理lzo压缩的文本文件，
<ul class="org-ul">
<li>hadoop-lzo本身没有自带LzoTextOutputFormat，这样的话之能够输出TextOutputFormat然后通过lzop压缩
</li>
<li><b>elephant-bird提供了很多额外的InputFormat/OutputFormat.</b>
</li>
</ul>
</li>
<li>如果使用本地测试集群的话，那么需要提供lzo encoder/decoder.
<ul class="org-ul">
<li>Configuration conf = new Configuration(); // 如果是本地测试集群的话，那么是没有读取core-site.xml的，因此也就是没有编码解码信息，需要通过下面语句提供
</li>
<li>conf.set("io.compression.codecs", "org.apache.hadoop.io.compress.DefaultCodec,org.apache.hadoop.io.compress.GzipCodec,com.hadoop.compression.lzo.LzopCodec");
</li>
<li>conf.set("io.compression.codec.lzo.class", "com.hadoop.compression.lzo.LzoCodec");
</li>
</ul>
</li>
<li>LzoIndexer.main(new String[]{kOutputFileName}); // 如果需要在程序里面进行indexer的话，那么可以直接调用LzoIndexer
<ul class="org-ul">
<li>如果是分布式的话可以调用 DistributedLzoIndexer.main
</li>
<li>当然也可以按照下面的方法通过程序调用
</li>
</ul>
</li>
</ul>

<p>
之后在输出目录下面会存在很多lzo文件，但是这些文件并不能够直接作为输入使用（因为hadoop不知道如何对这些lzo文件进行切分），需要对这些lzo文件进行索引。使用下面的命令来进行索引：
</p>
<ul class="org-ul">
<li>hadoop jar /usr/lib/hadoop/lib/hadoop-lzo-0.4.14.jar com.hadoop.compression.lzo.DistributedLzoIndexer &lt;output-dir&gt;
</li>
</ul>
<p>
完成之后对于每一个lzo文件都会存在一个.index文件。如果重复运行上面命令的话，会检查.index文件是否存在，如果存在的话那么就不会重新进行索引。
</p>

<p>
如果需要单独使用lzo而不是使用mapreduce来做压缩和解压缩的话，可以参考 <a href="https://github.com/dirtysalt/codes/tree/master/java/mr/src/main/java/com/dirlt/java/mr/UseLzoStandadlone.java">code on github</a>.
</p>
</div>
</div>

<div id="outline-container-sec-2-3" class="outline-3">
<h3 id="sec-2-3"><span class="section-number-3">2.3</span> 配合protobuf</h3>
<div class="outline-text-3" id="text-2-3">
<p>
elephant-bird实现了protobuf+lzo组合使用方式。
</p>

<p>
首先创建proto文件，比如message.proto
</p>
<pre class="example">
package com.dirlt.java.mr.proto;

// FATAL: This name works as a version number
// Increase this number everytime you do a non-compatible modification!!
// The block storage writer is responsible for write the version number.
option java_outer_classname = "MessageProtos1";

message Message {
  required string text = 1;
}
</pre>
<ul class="org-ul">
<li>package 名字空间
</li>
<li>java_outer_classname 具体输出类名称
</li>
</ul>
<p>
使用protoc &#x2013;java_out=&lt;dir&gt; message.proto就会在&lt;dir&gt;下面生成MessageProtos1.java文件。
</p>

<p>
此外我们还需要为这个类写几个辅助类，但是索性的是辅助类并不是很复杂。
</p>
<ul class="org-ul">
<li>InputFormat <a href="https://github.com/dirtysalt/codes/tree/master/java/mr/src/main/java/com/dirlt/java/mr/MessageLzoProtobufInputFormat.java">code on github</a>
</li>
</ul>
<div class="org-src-container">

<pre class="src src-Java">public class MessageLzoProtobufInputFormat extends LzoProtobufBlockInputFormat&lt;MessageProtos1.Message&gt; {
    public MessageLzoProtobufInputFormat() {
        super(new TypeRef&lt;MessageProtos1.Message&gt;() {
        });
    }
}
</pre>
</div>

<ul class="org-ul">
<li>OutputFormat <a href="https://github.com/dirtysalt/codes/tree/master/java/mr/src/main/java/com/dirlt/java/mr/MessageLzoProtobufOutputFormat.java">code on github</a>
</li>
</ul>
<div class="org-src-container">

<pre class="src src-Java">public class MessageLzoProtobufOutputFormat extends LzoProtobufBlockOutputFormat&lt;MessageProtos1.Message&gt; {
    public MessageLzoProtobufOutputFormat() {
        super(new TypeRef&lt;MessageProtos1.Message&gt;() {
        });
    }
}
</pre>
</div>

<ul class="org-ul">
<li>Writable <a href="https://github.com/dirtysalt/codes/tree/master/java/mr/src/main/java/com/dirlt/java/mr/MessageLzoProtobufWritable.java">code on github</a>
</li>
</ul>
<div class="org-src-container">

<pre class="src src-Java">public class MessageLzoProtobufWritable extends ProtobufWritable&lt;MessageProtos1.Message&gt; {
    public MessageLzoProtobufWritable() {
        super(new TypeRef&lt;MessageProtos1.Message&gt;() {
        });
    }

    public MessageLzoProtobufWritable(MessageProtos1.Message message) {
        super(message, new TypeRef&lt;MessageProtos1.Message&gt;() {
        });
    }
}
</pre>
</div>

<p>
关于如何使用lzo+protobuf可以参看代码示例 <a href="https://github.com/dirtysalt/codes/tree/master/java/mr/src/main/java/com/dirlt/java/mr/UseLzoProtobuf.java">code on github</a>. 值得注意的是如果输入为lzo文件的话，那么类型是ProtobufWritable&lt;M&gt;（泛型），如果需要取值的话必须通过setConverter提供类信息。
</p>
</div>
</div>
</div>
