src/mapred.org
*** MultipleInputs
- 参考代码 [[file:codes/java/mr/src/main/java/com/dirlt/java/mr/RunMultipleInputs1.java][code on github]]
- 支持一个htable和多个文件（但是对于htable不支持设置scan范围）
- 代码大致过程：
  - 使用 TableMapReduceUtil.initTableMapperJob 初始化htable输入（作用就是为了指定htable的input table name）
  - 之后在调用一次 MultipleInputs.addInputPath(job, new Path(kInTableName1), TableInputFormat.class, TMapper.class); 这里的kInTableName1可以随便定义，但是不要和接下来的hdfs路径重名。（作用是为了能够调整input format）
  - 接下来就是添加hdfs输入  MultipleInputs.addInputPath(job, new Path(kInFileName1), TextInputFormat.class, FMapper.class); 可以调用多次来添加多个hdfs输入源。
- 原理解释：
  - 使用MultipleInputs的话，hadoop会在环境变量中将输入内容设置成为inputPath=className, inputPath=className这样的字符串
  - MultipleInputs底层将InputFormat替换成为了自己的DelegateInputFormat.
  - DelegateInputFormat根据每个className初始化实例并且将inputPath给这个实例，这些对于FileInputFormat工作很好
  - 而对于TableInputFormat没有使用这个inputPath，而是直接读取configuration里面设置的TableOutputFormat.OUTPUT_TABLE这个值

*** MultipleTableInputFormat
- 参考代码 [[file:codes/java/mr/src/main/java/com/dirlt/java/mr/RunMultipleInputs2.java][code on github]]
- #note: 在cdh4.3.0下面运行的代码略有变动，存放在 [[file:codes/java/mr2/src/main/java/com/dirlt/java/mr2/RunMultipleInputs2.java][code on github]]
  - 需要配合MultipleInputs使用
  - 使用这个InputFormat可以同时支持多文件输入和多表输入
  - 多表输入还支持在一个table上面使用多个scan.
- 大致原理如下：
  - MultipleInputs底层使用Delegate模式，将inputFormat以及mapper和Path关联，然后将InputFormat实例化来对path进行切片得到InputSplit以及RecordReader.
  - 为了能够和MultipleInputs兼容使用，代码实现上将TableInput转换成为String然后表示成为Path（TableInput包括tableName以及多个scan对象）
    - string格式为 <tableName> ! hexString(scan) ! hexString(scan)
    - 从path中将TableInput字符串分离的代码是 path.toString().substring(path.getParent().toString().length() + 1);
  - MultipleTableInputFormat进行切片的时候将path取出内容进行解析，分离出TableInput出来，然后调用TableInputFormatBase的分片策略进行分片
    - setConf空实现是因为在ReflectionUtils.newInstance创建实例的时候会调用，而MultipleTableInputFormat本身没有使用到。
  - MultipleTableSplit的引入主要是因为TableSplit没有包含scan对象，而这个对象需要在TableRecordReader里面使用到。
    - InputSplit需要实现序列化的接口，因为切片信息生成是JobTracker完成保存在hdfs的，然后TaskTracker从hdfs中读取。

** 多路输出
*** MultipleOutputs
- 参考代码 [[file:codes/java/mr/src/main/java/com/dirlt/java/mr/RunMultipleOutputs.java][code on github]]
- 支持多个htable和多个文件
- 如果使用write(String namedOutput, K key, V value)会写到FileOutputFormat设置的目录下面，文件附上前缀namedOutput-，
- 如果使用write(String namedOutput, K key, V value, String baseOutputPath)
  - 如果baseOutputPath以/开头的话比如/a/b/c的话，那么输出文件为/a/b/c-m-00000
  - 如果baseOutputPath以/结尾的话比如/ab/c/的话，那么输出文件为/a/b/c/-m-00000.
  - 如果baseOutputPath没有以/开头的话，那么写到FileOutputFormat设置的目录下面，文件附上前缀baseOutputPath-.
- 因为最后输出是调用MultipleOutputs.write而非Context.write，因此和mrunit配合不太好
  - 可以通过MockMultipleOutputs来进行测试 参考代码 com.dirlt.java.mr.MockMultipleOutput

*** MultipleTableOutputFormat
- 参考代码 [[file:codes/java/mr/src/main/java/com/dirlt/java/mr/RunMultipleTableOutput.java][code on github]]
- 支持多个htable
- 调用context.write的key需要指定outputTable
  - 其实这也意味着如果是单表输出的话那么key为null即可
  - 前提是需要使用conf.set(TableOutputFormat.OUTPUT_TABLE,tableName);

** 获取集群运行状况
- 参考代码 [[file:codes/java/mr/src/main/java/com/dirlt/java/mr/ClusterSummary.java][code on github]]
- 获取更多信息可以阅读JobClient API

** OutOfMemoryError
- hadoop的mapreduce作业中经常出现Java heap space解决方案 http://blog.sina.com.cn/s/blog_6345041c01011bjq.html
- Hadoop troubleshooting http://ww2.cs.fsu.edu/~czhang/errors.html
- Thomas Jungblut's Blog: Dealing with "OutOfMemoryError" in Hadoop http://codingwiththomas.blogspot.jp/2011/07/dealing-with-outofmemoryerror-in-hadoop.html
- NoSQL | Hadoop http://www.nosql.se/tags/hadoop/

总结起来大致就是以下几种原因吧：
- Increase the heap size for the TaskTracker, I did this by changing HADOOP_HEAPSIZE to 4096 in /etc/hadoop/conf/hadoop-env.sh to test.  This did not solve it.（增加TaskTracker的heapsize）
- Increase the heap size for the spawned child.  Add -Xmx1024 in mapred-site.xml for mapred.map.child.java.opts.  This did not solve it. （增加task的heapsize）
- Make sure that the limit of open files is not reached, I had already done this by adding “mapred – nofile 65536″ in /etc/security/limits.conf.  This did not solve it. （增加文件数目限制）
- Adding the following to /etc/security/limits.conf and restarting the TaskTracker solved it "mapred – nproc 8192" （增加开辟子进程的数目）

** topology rack awareness
有两种方式实现，主要是实现DNS-name/IP到network path映射，network path是如下格式的字符串
- /switch/rack

第一种可以通过设置topology.node.switch.mapping.impl来设定DNSToSwitchMapping类
#+BEGIN_SRC Java
public interface DNSToSwitchMapping {
  public List<String> resolve(List<String> names);
}
#+END_SRC
实现这个类来完成DNS-name/IP-name到network path的映射.

但是存在另外一种更好的办法就是ScriptBasedMapping，这个是DNSToSwichMapping的一个实现，可以通过配置脚本来做映射。
将属性topology.script.filename设置成为脚本，脚本输入names，然后返回结果是按照空格或者是回车分隔的列表即可。
#note: 内部使用StringTokenizer来拆分结果

** streaming
- Hadoop Streaming http://hadoop.apache.org/docs/r1.1.2/streaming.html

streaming允许用户使用脚本来编写mapper/reducer，使用stdin/stdout作为通信接口。tasktracker spwan一个特殊的task, 这个task将mapper/reducer数据通过pipe传递给脚本。 #note: hadoop pipes则是使用unix socket和C++处理程序通信，基本思想是相同的

调用方式：hadoop $HADOOP_HOME/contrib/streaming/hadoop-streaming-*.jar <OPTIONS> 其中OPTIONS如下：
- -input
- -output
- -mapper # 执行命令比如cat,grep等，也可以是脚本但是必须+x
- -reducer
- -libjars
- -file # 执行任务中需要的文件. 如果是运行脚本的话那么脚本必须在这里也指定，这样才能分发到所有机器上
- -partitioner # 必须是java class
- -combiner # 必须是java class
- -D # 作业属性等
- -numReduceTasks # reduce数目
- -inputformat
- -outputformat
- -verbose # 详细输出
- -cmdenv # 环境变量
- -mapdebug 	# Script to call when map task fails
- -reducedebug # Script to call when reduce task fails

作业属性里面除了在编写Java MapReduce里面会涉及的属性外，一些和streaming相关的属性如下：
- stream.map.input.field.seperator / stream.map.output.field.seperator # map input/output kv分隔符，默认是\t
- stream.map.output.key.fields # map task输出记录中key所占域数目
- stream.reduce.input.field.seperator / stream.reduce.outout.field.separator
- stream.reduce.output.key.fields
- stream.non.zero.exit.is.failure = false # 默认返回0正常，但是也可以忽略

