html/mapred.html

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> 多路输入</h2>
<div class="outline-text-2" id="text-3">
</div><div id="outline-container-sec-3-1" class="outline-3">
<h3 id="sec-3-1"><span class="section-number-3">3.1</span> MultipleInputs</h3>
<div class="outline-text-3" id="text-3-1">
<ul class="org-ul">
<li>参考代码 <a href="https://github.com/dirtysalt/codes/tree/master/java/mr/src/main/java/com/dirlt/java/mr/RunMultipleInputs1.java">code on github</a>
</li>
<li>支持一个htable和多个文件（但是对于htable不支持设置scan范围）
</li>
<li>代码大致过程：
<ul class="org-ul">
<li>使用 TableMapReduceUtil.initTableMapperJob 初始化htable输入（作用就是为了指定htable的input table name）
</li>
<li>之后在调用一次 MultipleInputs.addInputPath(job, new Path(kInTableName1), TableInputFormat.class, TMapper.class); 这里的kInTableName1可以随便定义，但是不要和接下来的hdfs路径重名。（作用是为了能够调整input format）
</li>
<li>接下来就是添加hdfs输入  MultipleInputs.addInputPath(job, new Path(kInFileName1), TextInputFormat.class, FMapper.class); 可以调用多次来添加多个hdfs输入源。
</li>
</ul>
</li>
<li>原理解释：
<ul class="org-ul">
<li>使用MultipleInputs的话，hadoop会在环境变量中将输入内容设置成为inputPath=className, inputPath=className这样的字符串
</li>
<li>MultipleInputs底层将InputFormat替换成为了自己的DelegateInputFormat.
</li>
<li>DelegateInputFormat根据每个className初始化实例并且将inputPath给这个实例，这些对于FileInputFormat工作很好
</li>
<li>而对于TableInputFormat没有使用这个inputPath，而是直接读取configuration里面设置的TableOutputFormat.OUTPUT_TABLE这个值
</li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-3-2" class="outline-3">
<h3 id="sec-3-2"><span class="section-number-3">3.2</span> MultipleTableInputFormat</h3>
<div class="outline-text-3" id="text-3-2">
<ul class="org-ul">
<li>参考代码 <a href="https://github.com/dirtysalt/codes/tree/master/java/mr/src/main/java/com/dirlt/java/mr/RunMultipleInputs2.java">code on github</a>
</li>
<li>#note: 在cdh4.3.0下面运行的代码略有变动，存放在 <a href="https://github.com/dirtysalt/codes/tree/master/java/mr2/src/main/java/com/dirlt/java/mr2/RunMultipleInputs2.java">code on github</a>
<ul class="org-ul">
<li>需要配合MultipleInputs使用
</li>
<li>使用这个InputFormat可以同时支持多文件输入和多表输入
</li>
<li>多表输入还支持在一个table上面使用多个scan.
</li>
</ul>
</li>
<li>大致原理如下：
<ul class="org-ul">
<li>MultipleInputs底层使用Delegate模式，将inputFormat以及mapper和Path关联，然后将InputFormat实例化来对path进行切片得到InputSplit以及RecordReader.
</li>
<li>为了能够和MultipleInputs兼容使用，代码实现上将TableInput转换成为String然后表示成为Path（TableInput包括tableName以及多个scan对象）
<ul class="org-ul">
<li>string格式为 &lt;tableName&gt; ! hexString(scan) ! hexString(scan)
</li>
<li>从path中将TableInput字符串分离的代码是 path.toString().substring(path.getParent().toString().length() + 1);
</li>
</ul>
</li>
<li>MultipleTableInputFormat进行切片的时候将path取出内容进行解析，分离出TableInput出来，然后调用TableInputFormatBase的分片策略进行分片
<ul class="org-ul">
<li>setConf空实现是因为在ReflectionUtils.newInstance创建实例的时候会调用，而MultipleTableInputFormat本身没有使用到。
</li>
</ul>
</li>
<li>MultipleTableSplit的引入主要是因为TableSplit没有包含scan对象，而这个对象需要在TableRecordReader里面使用到。
<ul class="org-ul">
<li>InputSplit需要实现序列化的接口，因为切片信息生成是JobTracker完成保存在hdfs的，然后TaskTracker从hdfs中读取。
</li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> 多路输出</h2>
<div class="outline-text-2" id="text-4">
</div><div id="outline-container-sec-4-1" class="outline-3">
<h3 id="sec-4-1"><span class="section-number-3">4.1</span> MultipleOutputs</h3>
<div class="outline-text-3" id="text-4-1">
<ul class="org-ul">
<li>参考代码 <a href="https://github.com/dirtysalt/codes/tree/master/java/mr/src/main/java/com/dirlt/java/mr/RunMultipleOutputs.java">code on github</a>
</li>
<li>支持多个htable和多个文件
</li>
<li>如果使用write(String namedOutput, K key, V value)会写到FileOutputFormat设置的目录下面，文件附上前缀namedOutput-，
</li>
<li>如果使用write(String namedOutput, K key, V value, String baseOutputPath)
<ul class="org-ul">
<li>如果baseOutputPath以/开头的话比如/a/b/c的话，那么输出文件为/a/b/c-m-00000
</li>
<li>如果baseOutputPath以/结尾的话比如/ab/c/的话，那么输出文件为/a/b/c/-m-00000.
</li>
<li>如果baseOutputPath没有以/开头的话，那么写到FileOutputFormat设置的目录下面，文件附上前缀baseOutputPath-.
</li>
</ul>
</li>
<li>因为最后输出是调用MultipleOutputs.write而非Context.write，因此和mrunit配合不太好
<ul class="org-ul">
<li>可以通过MockMultipleOutputs来进行测试 参考代码 com.dirlt.java.mr.MockMultipleOutput
</li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-4-2" class="outline-3">
<h3 id="sec-4-2"><span class="section-number-3">4.2</span> MultipleTableOutputFormat</h3>
<div class="outline-text-3" id="text-4-2">
<ul class="org-ul">
<li>参考代码 <a href="https://github.com/dirtysalt/codes/tree/master/java/mr/src/main/java/com/dirlt/java/mr/RunMultipleTableOutput.java">code on github</a>
</li>
<li>支持多个htable
</li>
<li>调用context.write的key需要指定outputTable
<ul class="org-ul">
<li>其实这也意味着如果是单表输出的话那么key为null即可
</li>
<li>前提是需要使用conf.set(TableOutputFormat.OUTPUT_TABLE,tableName);
</li>
</ul>
</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> 获取集群运行状况</h2>
<div class="outline-text-2" id="text-5">
<ul class="org-ul">
<li>参考代码 <a href="https://github.com/dirtysalt/codes/tree/master/java/mr/src/main/java/com/dirlt/java/mr/ClusterSummary.java">code on github</a>
</li>
<li>获取更多信息可以阅读JobClient API
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-6" class="outline-2">
<h2 id="sec-6"><span class="section-number-2">6</span> OutOfMemoryError</h2>
<div class="outline-text-2" id="text-6">
<ul class="org-ul">
<li>hadoop的mapreduce作业中经常出现Java heap space解决方案 <a href="http://blog.sina.com.cn/s/blog_6345041c01011bjq.html">http://blog.sina.com.cn/s/blog_6345041c01011bjq.html</a>
</li>
<li>Hadoop troubleshooting <a href="http://ww2.cs.fsu.edu/~czhang/errors.html">http://ww2.cs.fsu.edu/~czhang/errors.html</a>
</li>
<li>Thomas Jungblut's Blog: Dealing with "OutOfMemoryError" in Hadoop <a href="http://codingwiththomas.blogspot.jp/2011/07/dealing-with-outofmemoryerror-in-hadoop.html">http://codingwiththomas.blogspot.jp/2011/07/dealing-with-outofmemoryerror-in-hadoop.html</a>
</li>
<li>NoSQL | Hadoop <a href="http://www.nosql.se/tags/hadoop/">http://www.nosql.se/tags/hadoop/</a>
</li>
</ul>

<p>
总结起来大致就是以下几种原因吧：
</p>
<ul class="org-ul">
<li>Increase the heap size for the TaskTracker, I did this by changing HADOOP_HEAPSIZE to 4096 in /etc/hadoop/conf/hadoop-env.sh to test.  This did not solve it.（增加TaskTracker的heapsize）
</li>
<li>Increase the heap size for the spawned child.  Add -Xmx1024 in mapred-site.xml for mapred.map.child.java.opts.  This did not solve it. （增加task的heapsize）
</li>
<li>Make sure that the limit of open files is not reached, I had already done this by adding “mapred – nofile 65536″ in /etc/security/limits.conf.  This did not solve it. （增加文件数目限制）
</li>
<li>Adding the following to /etc/security/limits.conf and restarting the TaskTracker solved it "mapred – nproc 8192" （增加开辟子进程的数目）
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-7" class="outline-2">
<h2 id="sec-7"><span class="section-number-2">7</span> topology rack awareness</h2>
<div class="outline-text-2" id="text-7">
<p>
有两种方式实现，主要是实现DNS-name/IP到network path映射，network path是如下格式的字符串
</p>
<ul class="org-ul">
<li>/switch/rack
</li>
</ul>

<p>
第一种可以通过设置topology.node.switch.mapping.impl来设定DNSToSwitchMapping类
</p>
<div class="org-src-container">

<pre class="src src-Java">public interface DNSToSwitchMapping {
  public List&lt;String&gt; resolve(List&lt;String&gt; names);
}
</pre>
</div>
<p>
实现这个类来完成DNS-name/IP-name到network path的映射.
</p>

<p>
但是存在另外一种更好的办法就是ScriptBasedMapping，这个是DNSToSwichMapping的一个实现，可以通过配置脚本来做映射。
将属性topology.script.filename设置成为脚本，脚本输入names，然后返回结果是按照空格或者是回车分隔的列表即可。
#note: 内部使用StringTokenizer来拆分结果
</p>
</div>
</div>

<div id="outline-container-sec-8" class="outline-2">
<h2 id="sec-8"><span class="section-number-2">8</span> streaming</h2>
<div class="outline-text-2" id="text-8">
<ul class="org-ul">
<li>Hadoop Streaming <a href="http://hadoop.apache.org/docs/r1.1.2/streaming.html">http://hadoop.apache.org/docs/r1.1.2/streaming.html</a>
</li>
</ul>

<p>
streaming允许用户使用脚本来编写mapper/reducer，使用stdin/stdout作为通信接口。tasktracker spwan一个特殊的task, 这个task将mapper/reducer数据通过pipe传递给脚本。 #note: hadoop pipes则是使用unix socket和C++处理程序通信，基本思想是相同的
</p>

<p>
调用方式：hadoop $HADOOP_HOME/contrib/streaming/hadoop-streaming-*.jar &lt;OPTIONS&gt; 其中OPTIONS如下：
</p>
<ul class="org-ul">
<li>-input
</li>
<li>-output
</li>
<li>-mapper # 执行命令比如cat,grep等，也可以是脚本但是必须+x
</li>
<li>-reducer
</li>
<li>-libjars
</li>
<li>-file # 执行任务中需要的文件. 如果是运行脚本的话那么脚本必须在这里也指定，这样才能分发到所有机器上
</li>
<li>-partitioner # 必须是java class
</li>
<li>-combiner # 必须是java class
</li>
<li>-D # 作业属性等
</li>
<li>-numReduceTasks # reduce数目
</li>
<li>-inputformat
</li>
<li>-outputformat
</li>
<li>-verbose # 详细输出
</li>
<li>-cmdenv # 环境变量
</li>
<li>-mapdebug     # Script to call when map task fails
</li>
<li>-reducedebug # Script to call when reduce task fails
</li>
</ul>

<p>
作业属性里面除了在编写Java MapReduce里面会涉及的属性外，一些和streaming相关的属性如下：
</p>
<ul class="org-ul">
<li>stream.map.input.field.seperator / stream.map.output.field.seperator # map input/output kv分隔符，默认是\t
</li>
<li>stream.map.output.key.fields # map task输出记录中key所占域数目
</li>
<li>stream.reduce.input.field.seperator / stream.reduce.outout.field.separator
</li>
<li>stream.reduce.output.key.fields
</li>
<li>stream.non.zero.exit.is.failure = false # 默认返回0正常，但是也可以忽略
</li>
</ul>
</div>
</div>
